Revit 2017 API
PipeSettings.GetPressLossCalculationServerInfo Method
 Get the MEPServerInfo of the current pipe pressure loss calculation server.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2012
Syntax
C#
public MEPCalculationServerInfo GetPressLossCalculationServerInfo()
Visual Basic
Public Function GetPressLossCalculationServerInfo As MEPCalculationServerInfo
Visual C++
public:
MEPCalculationServerInfo^ GetPressLossCalculationServerInfo()
Return Value
 The MEPServerInfo of the current pipe pressure loss calculation server
See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace